## Snowflake Connector for Python

In [1]:
#pip install snowflake-connector-python
#pip install pyarrow
#pip install "snowflake-connector-python[pandas]"

In [31]:
import snowflake.connector as sfc
import pandas as pd
from snowflake.connector.pandas_tools import write_pandas

In [40]:
USERNAME=""
PASSWORD=""
ACCOUNT_LOCATOR=""
WAREHOUSE=""
DATABASE="PRACTICE_DB"
SCHEMA="STAGE_SCHEMA"
REGION="central-india.azure"

In [41]:
conn = sfc.connect(
    user=USERNAME,
    password=PASSWORD,
    account=ACCOUNT_LOCATOR,
    warehouse=WAREHOUSE,
    database=DATABASE,
    schema=SCHEMA,
    region=REGION
)

In [42]:
curr = conn.cursor()

### Read - SELECT

In [45]:
selectQuery = "SELECT cust_id, cust_name, age FROM customer_details WHERE age > 40;"

In [46]:
curr.execute(selectQuery)

In [47]:
#curr.fetchall()
df = curr.fetch_pandas_all()

In [48]:
df

   CUST_ID        CUST_NAME  AGE
0      101    Finn Aloysius   44
1      103  Wright Gretchen   43
2      104        Ally Luna   64
3      106    Annice Taylor   43
4      107      Alita Harry   47

### Create - INSERT

In [51]:
new_customers = [
    {
        "CUST_NAME": "Glenn Maxwell",
        "AGE": 87
    },
    {
        "CUST_NAME": "David Warner",
        "AGE": 74
    }
]

In [52]:
new_customers_df = pd.DataFrame(new_customers)
new_customers_df

       CUST_NAME  AGE
0  Glenn Maxwell   87
1   David Warner   74

In [53]:
res = write_pandas(conn, new_customers_df, 'CUSTOMER_DETAILS')

In [56]:
success, nchunks, nrows, _ = res
res

(True,
 1,
 2,
 [('urtzhicgfi/file0.txt', 'LOADED', 2, 2, 1, 0, None, None, None, None)])

### Update - UPDATE

In [57]:
name = "Alex Turing"
id = "100"

In [60]:
updateQuery = f"UPDATE customer_details SET cust_name = '{name}' WHERE cust_id = {id};"
updateQuery

"UPDATE customer_details SET cust_name = 'Alex Turing' WHERE cust_id = 100;"

In [61]:
curr.execute(updateQuery)

In [62]:
curr.rowcount

1

### Delete - DELETE

In [63]:
id = 105

In [64]:
deleteQuery = f"DELETE FROM customer_details WHERE cust_id = {id};"
deleteQuery

'DELETE FROM customer_details WHERE cust_id = 105;'

In [65]:
curr.execute(deleteQuery)
curr.rowcount

1